{
  "entry": "Hello!",
  "thirdDesignEntry": "Creative thinker Minimalism lover",
  "thirdDesignHeaderAboutMe": "As a Firat University Software Engineering graduate and Full Stack Developer, I develop scalable and innovative web applications using Java, Spring Boot, and React. A curious Software Engineer who loves learning about every technology and continuous improvement.",
  "headerAboutMe": "I'm Ali. As a Firat University Software Engineering graduate and Full Stack Developer, I develop scalable and innovative web applications using Java, Spring Boot, and React. A curious Software Engineer who loves learning about every technology and continuous improvement.",
  "secondHeaderAboutMe": "I am a Full-Stack Developer",
  "headerText": "Would you like to work together? Contact me.",
  "secondHeaderText": "As a Firat University Software Engineering graduate and Full Stack Developer, I develop scalable and innovative web applications using Java, Spring Boot, and React. A curious Software Engineer who loves learning about every technology and continuous improvement.",
  "skillsTitle": "SKILLS",
  "profileTitle": "PROFILE",
  "basicInfo": "Basic Information",
  "projectTitle": "PROJECTS",
  "dateOfBirthTitle": "Date Of Birth",
  "residenceTitle": "Residance",
  "educationTitle": "Education",
  "preferredRoleTitle": "Preferred Role",
  "aboutMeTitle": "About me",
  "footerText": "Let’s work together on your next product.",
  "footerAltText": "Got a question or proposal, or just wantto say hello? Go ahead.",
  "github": "View on Github",
  "goApp": "Go to App",
  "email": "aliyzbsi68@hotmail.com",
  "cv": "Resume",
  "projects": [
    {
      "id": 1,
      "name": "Teknolojik Pizza",
      "description": "The 'Teknolojik Pizza' website was created to provide a thematic experience focused on the digitalization of the food industry, specifically for pizza ordering or delivery simulation. Designed to help users better understand the online food ordering process, the site incorporates an interactive structure to enhance user engagement.",
      "url": "https://teknolojik-pizza.vercel.app",
      "githubUrl": "https://github.com/aliyzbsi/teknolojik-pizza",
      "dateCreated": "2024-10-12",
      "technologies": [
        "React",
        "Cypress",
        "Tailwind",
        "Vercel",
        "Axios",
        "Toastify",
        "Router"
      ]
    },
    {
      "id": 2,
      "name": "WORKINTECH COMMERCE",
      "description": " The website 'WORKINTECH COMMERCE' serves as a practical demonstration of an e-commerce platform, showcasing various functionalities such as product listings, a shopping cart, and order management. It is designed for educational purposes, allowing users to understand how e-commerce applications function. The site is built using modern web technologies, including React for the frontend and Vite for development. For further details, you can visit the site directly",
      "url": "https://ecommerceformypractice.vercel.app/",
      "githubUrl": "https://github.com/aliyzbsi/E-commerce-for-begin",
      "dateCreated": "2024-11-04",
      "technologies": [
        "React",
        "Vercel",
        "React Hook Form",
        "Axios",
        "Tailwind",
        "Tanstack",
        "Router",
        "Toastify"
      ]
    },
    {
      "id": 3,
      "name": "To-Do App",
      "description": " The website 'alinintodolisti' provides a simple and functional to-do list experience for users to organize their tasks. Such applications allow users to organize their tasks, mark them as completed, and track their progress.",
      "url": "https://alinintodolisti.vercel.app",
      "githubUrl": "https://github.com/aliyzbsi/ToDoApp",
      "dateCreated": "2023-11-03",
      "technologies": [
        "React",

        "React Hook Form",
        "Router",
        "Toastify",

        "Vercel"
      ]
    },
    {
      "id": 4,
      "name": "Ali Yüzbaşı Portfolio",
      "description": "The platform is designed to showcase the developer's skills and projects. It provides users with a detailed presentation of the developer's projects, technical abilities, and experiences, allowing potential employers and clients to effectively get to know the developer.",
      "url": "https://example.com/proje2",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2024-11-04",
      "technologies": ["React", "Tailwind", "Vercel"]
    },
    {
      "id": 5,
      "name": "MovieDB",
      "description": "The site is a platform that allows users to explore and manage movie data. It aims to enhance user experience by offering functions such as searching, listing, and accessing detailed information about films. The developer has utilized modern web technologies like React and Redux to create a dynamic and interactive interface. The application retrieves updated content via an API. For more information, you can visit the site.",
      "url": "https://moviedb-redux.onrender.com",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2023-01-01",
      "technologies": ["React", "Render", "Redux", "Axios", "Router"]
    }
  ],

  "personelInfo": [
    {
      "dateOfBirth": "20/01/1999",
      "residenceAdr": "Aksaray",
      "preferredRole": ["Frontend", "Backend"],
      "education": "Firat University, Software Engineering, Bachelor's Degree, 2022",
      "aboutMe": "I was born on January 20, 1999 in Aksaray/Ortaköy and spent the early years of my education there. I completed my undergraduate education in Software Engineering at Firat University and graduated in 2022. During my education, I had the opportunity to develop myself by researching different programming languages, developing projects, and completing internships. After graduation, I completed my military service as Test and Evaluation Section Chief at the MSÜ Information Processing Department SOME Branch. Afterwards, I advanced my career by receiving training from experts through the Full-Stack Development Bootcamp from Workintech. Now, I aim to further advance my career by learning new technologies and improving myself in the software field."
    }
  ],
  "skills": [
    {
      "id": 1,
      "name": "JAVASCRIPT",
      "img": "/assets/skills/js.png",
      "skillDesc": "Advanced proficiency in JavaScript with comprehensive understanding of the language. Can write code for complex projects and optimize existing structures. Skilled in improving code maintenance and performance."
    },
    {
      "id": 2,
      "name": "REACT",
      "img": "/assets/skills/react.png",
      "skillDesc": "Specialized in the React ecosystem and actively implements modern React techniques in projects. Can create performance-optimized structures and ensure code maintainability."
    },
    {
      "id": 3,
      "name": "JAVA",
      "img": "/assets/skills/java.png",
      "skillDesc": "Intermediate-level coding skills in Java, capable of developing projects with fundamental programming structures. Can write code following OOP principles."
    },
    {
      "id": 4,
      "name": "SPRING",
      "img": "/assets/skills/spring.png",
      "skillDesc": "Can develop web applications and microservices with Spring Framework. Effectively uses core Spring concepts such as dependency injection and AOP."
    },
    {
      "id": 5,
      "name": "REDUX",
      "img": "/assets/skills/redux.svg",
      "skillDesc": "Effectively controls data flow in large and complex projects through Redux state management. Uses optimized Redux designs that ensure maintainability in projects."
    },
    {
      "id": 6,
      "name": "NODE",
      "img": "/assets/skills/node.png",
      "skillDesc": "Basic competency in Node.js environment, capable of implementing simple to intermediate backend development projects. Ensures security and performance adequacy of software."
    },
    {
      "id": 7,
      "name": "HTML",
      "img": "/assets/skills/html.png",
      "skillDesc": "Creates content fully compliant with HTML5 standards, following accessibility (a11y) and semantic structure rules. Provides advanced structure and organization in projects."
    },
    {
      "id": 8,
      "name": "CSS",
      "img": "/assets/skills/css.png",
      "skillDesc": "High proficiency in CSS3 and preprocessors, effectively using modern styling techniques and animations in projects. Creates designs responsive to different screen sizes and devices."
    },
    {
      "id": 9,
      "name": "C#",
      "img": "/assets/skills/csharp.png",
      "skillDesc": "Intermediate-level coding skills in C#, capable of developing applications in the .NET ecosystem. Can write code following OOP principles and use basic data structures."
    },
    {
      "id": 10,
      "name": ".NET",
      "img": "/assets/skills/dotnet.png",
      "skillDesc": "Can develop web applications and APIs with .NET Framework and .NET Core. Able to implement core concepts such as dependency injection and MVC architecture."
    },
    {
      "id": 11,
      "name": "GITHUB",
      "img": "/assets/skills/github.png",
      "skillDesc": "Effectively uses GitHub in development and collaboration processes. Applies best practices for version control, branch management, and collaboration."
    },
    {
      "id": 12,
      "name": "FIREBASE",
      "img": "/assets/skills/firebase.png",
      "skillDesc": "Can create basic database, authentication, and hosting solutions using Firebase in projects. Able to establish comprehensive backend structures to manage data flow."
    },
    {
      "id": 13,
      "name": "VSCODE",
      "img": "/assets/skills/vscode.png",
      "skillDesc": "Effectively uses Visual Studio Code, skillfully managing extensions and configurations to increase productivity. Capable of customizing the workspace according to project needs."
    },
    {
      "id": 14,
      "name": "PYTHON",
      "img": "/assets/skills/python.png",
      "skillDesc": "Knowledgeable about basic programming structures in Python. Can read and code simple Python projects."
    },
    {
      "id": 15,
      "name": "VERCEL",
      "img": "/assets/skills/vercel.png",
      "skillDesc": "Can quickly configure and deploy projects on Vercel. Knowledgeable about CI/CD processes and can create continuous deployment structures."
    },
    {
      "id": 16,
      "name": "TAILWIND",
      "img": "/assets/skills/tailwind.png",
      "skillDesc": "Proficient in rapid and modular style development with Tailwind CSS. Specialized in creating customized and high-performance user interfaces."
    },
    {
      "id": 17,
      "name": "BOOTSTRAP",
      "img": "/assets/skills/boostrap.png",
      "skillDesc": "Can efficiently and quickly develop responsive designs with Bootstrap. Creates customized and user-focused interfaces, contributing to the UI/UX enrichment of projects."
    },
    {
      "id": 18,
      "name": "DOCKER",
      "img": "/assets/skills/docker.png",
      "skillDesc": "Can package and distribute applications using Docker containers. Understands and implements basic Docker commands and configurations."
    },
    {
      "id": 19,
      "name": "GIT",
      "img": "/assets/skills/git.png",
      "skillDesc": "Can effectively use the Git version control system. Performs branch, merge, and rebase operations and manages the codebase."
    },
    {
      "id": 20,
      "name": "AWS",
      "img": "/assets/skills/aws.png",
      "skillDesc": "Can perform basic infrastructure and application deployment using AWS cloud services. Understands and uses core AWS services such as EC2, S3, and Lambda."
    }
  ]
}
